{
    "position": "Graduate Software Developer",
    "name": "Harlow Printing Limited",
    "description": "Are you a recent graduate looking to kick\\-start your career in software development with a unique twist? At Harlow Solutions, we’re looking for a Graduate Software Developer who isn’t just interested in traditional coding but wants to dive into a hands\\-on role that combines software with real\\-world print production.\n\n**About Us**:\n\nHarlow is one of the UK’s leading suppliers of print management and fulfilment management services to both the private and public sectors. We cover all aspects of a product’s journey, from design, sourcing, print, through to finishing, stock management and distribution. Our comprehensive document and fulfilment solutions cover healthcare, councils, police, local authorities, schools, and universities in the public sector as well as private sector organisations.\n\nOur central focus is customer service and our aim is to provide high quality products and solutions. We have provided these solutions for over 75 years and have a proven track record of delivery and supporting our customers with efficiency savings whilst ensuring consistently high levels of service.\n\n**About the Role**:\n\nAs a Graduate Software Developer, you’ll work closely with our Senior Software Developer to create, test, and enhance a range of print\\-ready products for various lithographic and digital print machines. These include direct mail solutions, promotional games for newspapers, scratch cards, and breakopens, each requiring precision and creativity. You’ll also support our in\\-house software projects and troubleshoot any software\\-related issues in production, gaining valuable problem\\-solving skills along the way.\n\n**What You’ll Do**:\n\n* Develop and refine software for direct mail, scratch cards, breakopens, and promotional games.\n* Support in\\-house software development initiatives, gaining exposure to multiple project phases.\n* Troubleshoot and resolve any software issues that impact production.\n\n**What We’re Looking For**:\n\n* A recent graduate with a degree in Software Development, Computer Science, or a related field.\n* A passion for innovative software solutions that integrate with tangible products.\n* Problem\\-solving skills and an eagerness to tackle technical challenges.\n* Excellent attention to detail and a proactive approach.\n\n**What You’ll Get:**\n\n**Hands\\-On Experience:** Work on real projects from day one, gaining exposure to both software development and the print production industry.\n\n**Professional Growth:** Access to training and development opportunities tailored to enhance your skills in a unique, hybrid software and production environment.\n\n**Innovative Work Culture:** Be part of a team that values creativity, problem\\-solving, and a commitment to excellence.\n\nJob Types: Full\\-time, Permanent\n\nAdditional pay:\n\n* Yearly bonus\n\nBenefits:\n\n* Company pension\n* Sick pay\n\nSchedule:\n\n* Day shift\n* Monday to Friday\n\nEducation:\n\n* Bachelor's (preferred)\n\nExperience:\n\n* Software Development: 1 year (required)\n\nWork authorisation:\n\n* United Kingdom (required)\n\nWork Location: In person\n\nApplication deadline: 08/11/2024",
    "url": "https://uk.indeed.com/viewjob?jk=b9c5e12e12644ffb",
    "is_remote": false,
    "interviews": [
        {
            "name": "Preliminary Round",
            "type": "Technical"
        },
        {
            "name": "Personal",
            "type": "HR"
        },
        {
            "name": "Technical Interview",
            "type": "Managerial"
        }
    ]
}