{
    "position": "Junior software engineer - Remote",
    "name": "Jisc",
    "description": "**Salary:** Circa £26,000 per annum negotiable depending on experience \\+ fantastic benefits\n  \n**Jisc grade:** TSO1 (internal use only)\n  \n**Hours:** 35 hours per week\n  \n**Contract:** Permanent\n  \n**Location:** Remote\n  \n  \n\n**About Jisc:**  \n\nJisc is the UK digital, data and technology agency focused on tertiary education, research, and innovation. We are a not\\-for\\-profit organisation with a big ambition to improve lives through education and research by providing hardware, software, and networking solutions. Our talented people bring their own unique skills and experience to empower our members and customers with the technology they need to succeed. Take your next career step with us and you can make a real difference to the education and research sectors.\n  \n  \n\n**About the team:**  \n\nThe Trust \\& Identity development team is responsible for applications and infrastructure which support the Research and Education sector. We develop and maintain backend applications in Java and frontend applications in python. We are looking for a junior software engineer to increase the resilience and development capacity of the current team.\n  \n  \n\n**About the role:**  \n\nThe primary purpose of this new role is the maintenance and development of the metadata management system for the UK Access Management Federation. This backend system is written in Java using the Shibboleth Metadata Aggregator framework and has extensive business logic written in XML, XSLT and XPath. It supports web single sign\\-on for UK Research and Education communities, and we integrate with the Research and Education sector in over 70 countries. All of the development team work on this system and the successful applicant will focus on the Java core.\n  \n  \n\n**Responsibilities will include:**  \n\n* Maintenance and development of the metadata management system for the UK Access Management Federation\n* Focusing on the Java core\n* Maintenance and development of our build automation system\n* Vulnerability management by identifying, prioritizing, and mitigating vulnerabilities directly in our applications and transitively in any third\\-party software dependencies they use\n* Exploring and improving our use of, amongst others, software bill of materials, code scanning engines, software vulnerability databases, and code provenance and trust\n\n\n**Key Skills and Experience:**  \n\n* Demonstrable professional experience in a coding environment, ideally in implementing technical specifications in software\n* Experience working on a shared codebase with a ticketing system\n* Developing software under the Apache 2 license would be perfect, as would experience of the full software development lifecycle\n* Software development experience in Java using the Spring Framework along with an understanding of XML and namespaces\n* Experience with Build automation systems (such as GitLab CI, Maven, Gradle, ant, Jenkins), Git revision control and feature branch\\-based development\n\n\nDon’t meet every single requirement?\n  \nWe know that sometimes people can be put off applying for a job if they think they can’t tick every box, so we encourage you to apply even if you do not meet 100% of the requirements, but you feel this role is perfect for you. You may be just the right candidate for this or other roles!\n  \n  \n\nWhy work for us?\n  \nAt Jisc, everyone plays a key role and gets the chance to feel part of it, that to us is the definition of a meaningful career. We want to create a culture of lifelong learning. You can look forward to a rewarding job with opportunities to develop and make a real difference to the education and research sectors.\n  \n  \n\nWe believe a balance between your personal and professional life is essential to your happiness and fulfilment. We work flexibly at Jisc and focus on outputs rather than presenteeism and are open to a whole range of ways of working.\n  \n  \n\nIt isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. Our hybrid working policy is flexible, and the frequency of time spent in your nominated office will vary across teams and job roles.\n  \n  \n\n**Take a look at our fantastic benefits! We offer:**  \n\n* Flexible work pattern, which can adapt to suit your schedules and personal commitments\n* 31 days annual leave (plus bank holidays) that includes an additional three closure days over Christmas plus the opportunity to buy up to an additional 5 days\n* Generous flexible pension schemes\n* Protection benefit – life cover\n* Annual Jisc performance award\n* A range of wellbeing lifestyle benefits including company paid health care cash plan, employee assistance programme, mental health first aiders and support\n* A generous budget to support you with external learning and continuous professional development\n* Allocated allowance of up to £250 to equip your home office\n* Financial well\\-being support including access to preferential loan and savings plans, mortgage advice, will writing tools and support and resources to help you make the most of your money\n* The opportunity to donate to charity tax\\-free with our Payroll Giving benefit\n* Electric Car Lease Scheme and option to purchase SmartTech – spreading the cost of your everyday white goods and technology\n* A wide range of discounts from retailers and big\\-name high\\-street stores and CSSC membership\n* Family friendly policies including enhanced parental, maternity and paternity leave and opportunity for career breaks\n* Support your volunteering with up to 3 days volunteer leave\n* Cycle to work scheme and eye care scheme including free eye test vouchers and £70 towards new glasses for VDU use\n* Free flu vaccinations\n* Employee recognition awards and travel loans\n* A company culture which supports and promotes personal learning and development, including access to thousands of courses on LinkedIn Learning\n\n\n**Equity, diversity and inclusion:**  \n\nAt Jisc, we don’t look for ‘sameness’, but to truly include people who can add unique perspectives and experiences to our culture, and we are working hard to achieve progressive change. ‘Always inclusive’ is one of our six guiding principles which actively encourages us to bring our whole authentic selves to work. We believe that our commitment to equity, diversity and inclusion is fundamental to our success.\n  \n  \n\nJisc believes our people make all the difference in cultivating an inclusive culture that welcomes ideas, encourages innovation, and values belonging. We work with passionate colleagues to strengthen knowledge and awareness, provide learning and development opportunities, and foster multiple employee networks which create a sense of community and influence our policies and practice.\n  \n  \n\nWe work hard to create an equitable experience for our candidates and workforce which embraces all aspects of their identity including race and ethnicity, religion and belief, sex, gender identity, sexual orientation, trans identities, age, class, disability, neurodivergence, or veteran status.\n  \n  \n\n**Application process:**  \n\nWe want you to showcase your talent throughout the recruitment process. Please let us know how we can best support you to do that; for example, if there are any reasonable adjustments we may be able to put in place. We will be happy to help you.\n  \n  \n\nJust so you know, we review CVs as soon as we can and aim to provide an update on your application within 4 weeks of receiving it. However, you may hear from us a lot sooner, so please keep an eye out for our emails or calls!\n  \n  \n\nIf you are currently a Jisc employee, please apply through your Dayforce Employee profile.\n  \n  \n\nJisc has an active sponsor licence to recruit on a Skilled worker visa basis. Candidates wishing to apply who require sponsorship should determine the likelihood of obtaining a Certificate of Sponsorship for the role by assessing their circumstances against the relevant Home Office criteria. Jisc does not offer any financial re\\-imbursement towards the applicant costs, such as re\\-location, skilled worker visa and dependant costs or the immigration health charge.\n  \n  \n\nNo agencies please.\n  \n  \n\nYou will need to create an account and sign in to apply for a role",
    "url": "https://www.glassdoor.co.uk/job-listing/j?jl=1009511393031",
    "is_remote": false,
    "interviews": [
        {
            "name": "Preliminary Round",
            "type": "Technical",
            "score": 0
        },
        {
            "name": "Personal",
            "type": "HR",
            "score": 0
        },
        {
            "name": "Technical Interview",
            "type": "Managerial",
            "score": 0
        }
    ]
}