{
    "position": "Lecturer / Senior Lecturer in Computer Science and Engineering",
    "name": "UNSW",
    "description": "This Job is based in Australia\n\nJob Details\n• Salary\n• Lecturer - Level B, AUD $123,620 to $ 145,730 per annum + 17% superannuation\n• Senior Lecturer – Level C, AUD$150,148 to $172,261 per annum + 17% superannuation\n• Full time\n• Multiple roles - 2-years fixed term, 2-year convertible tenure track or continuing\n• Location: Kensington – Sydney, Australia\n\nThe Opportunity\n\nJoin the School of Computer Science and Engineering (CSE) in the Faculty of Engineering as a Lecturer/Senior Lecturer in a Teaching and Research role. CSE is currently undergoing a continued period of expansion and recruiting several new academic staff to start in 2024 and 2025, with multiple opportunities available. We are looking for highly motivated Computer Science Academics to conduct independent research and deliver excellent teaching.\n\nThere are several opportunities for teaching and research roles including but not limited to the areas below:\n• Systems including Networks, Operating Systems, Architecture, Embedded Systems, Cloud Computing, and Distributed Systems\n• Programming languages / theory of programming languages\n• Formal Methods\n• Algorithms\n• Cybersecurity\n• Foundations of Machine Learning\n• Computer Graphics\n• Robotics and reinforcement Learning\n• Natural Language Processing\n\nThis is an opportunity to join an organisation that is helping to shape the future direction of computing in Australia. The students and research produced in CSE can impact the world!\n\nThe role of Lecturer/Senior Lecturer reports to the Head of School and has no direct reports.\n\nThe School\n\nThe School of Computer Science and Engineering (CSE) in the Faculty of Engineering at UNSW is one of the largest Schools of its kind in Australia, with the greatest impact on society through our academic excellence in teaching and research, leading to societal impact and translation. The School is the largest within the Faculty of Engineering, currently with nearly 6500 students and 76 academic staff, which is growing with an operating budget of over $32 million.\n\nOur academic staff have research focus in areas including Artificial Intelligence, Computer Systems, Secure and Trustworthy Systems, Theoretical Computer Science, Data Science and Information Systems, and Humans and Machines. Research on developing cutting-edge technology as well as human-centred computing is encouraged, with high emphasis on societal impact and translation.\n\nCSE is proud of its long tradition of teaching excellence and student culture. We offer undergraduate programs in Software Engineering, Computer Engineering, Computer Science, Bioinformatics and Cyber Security, a postgraduate degree in Information Technology as well as a number of combined degrees with other disciplines . We are recognised for educational excellence in numerous fields including AI, operating systems, security engineering and first year programming. CSE attracts excellent students who have an outstanding record in international competitions, startups, and employment outcomes in leading tech firms. People join CSE for the opportunity to work with top-tier students and to join a community of scholars who support them in achieving their full potential. CSE attracts the brightest students as we offer the most technically rigorous computing degrees in Australia. The challenges we present ensure that our students reach their greatest potential and are ready to have a lasting impact on society.\n\nOur school is in the heart of Sydney and is Australia’s largest centre for computationally directed business, design and culture. This vibrant nexus brings together a diversity of creative engineering and design innovation, where world-leading education allows our thousands of students and researchers to become world-leading and world-building innovators. CSE students take on a collaborative role in the creation of a vibrant student experience, with many student societies, and are actively involved in teaching and learning opportunities within the school. For further information about the School, please visit - https://www.unsw.edu.au/engineering/our-schools/computer-science-and-engineering\n\nUNSW\n\nUNSW is not like other places you may have worked at. Yes, we are a large organisation with a diverse and talented community; a community doing extraordinary things. But what makes us different is not only what we do, it is how we do it. Together, we are driven to be thoughtful, practical, and purposeful in all we do. If you want a career where you can thrive, be challenged, and do meaningful work, you are in the right place.\n\nUNSW has three strategic priority areas. Firstly, a drive for academic excellence in research and education. Universities are often classified as ‘research intensive’ or ‘teaching intensive’. UNSW is proud to be an exemplar of both. We are among a limited group of universities worldwide capable of delivering research excellence alongside the highest quality education on a large scale. Secondly, a passion for social engagement, which improves lives through advancing equality, diversity, open debate, and economic progress. Thirdly, a commitment to achieving societal impact and translation through sharing our capability in research and education in the highest quality partnerships with institutions in both developed and emerging societies. We regard the interplay of academic excellence, social engagement, and societal impact and translation as the hallmarks of a great forward-looking 21st century university. To contribute to this journey, UNSW launched its first EDI Strategy in 2015 and became the first university in Australia to establish the Division of Equity and Diversity in 2017. The UNSW EDI strategy 2022-2025 can be found here.\n\nAccountabilities\n\nLevel B – Lecturer\n\nSpecific Accountabilities For The Role Level B Lecturer Include\n• Demonstrate and continuously develop a well-defined teaching philosophy that inspires student learning.\n• Conduct classes, assess student learning achievements and support students in postgraduate and undergraduate courses in line with UNSW policy.\n• Design and develop learning activities and resources and provide assessment and feedback using a range of suitable approaches and learning environments.\n• Initiate the development of experimental approaches to teaching and learning with the support of more senior academics.\n• Support learning progression with students as individuals (through such activities as one-to-one consultation) and as a cohort (through general course-related advice) to achieve positive learning and employability outcomes for students.\n• Manage course administration as Course Authority, including academic quality assurance.\n• Maintain professional development in pedagogy, disciplinary knowledge and minimum professional accreditation requirements (where relevant).\n• Make a positive contribution to School meetings and seminars and be a member of School/Faculty committees as required.\n• Engage in individual and/or collaborative research in a manner consistent with disciplinary practice.\n• Create scholarly impact which is recognised by peers in the advancement of disciplinary knowledge.\n• Conduct research/scholarly activities under limited supervision, either independently or as a member of a team (as per the norms of the discipline) and design research projects.\n• Contribute to the development of applications for competitive funding under the guidance of senior colleagues, including participating as co-investigator or chief investigator in competitive grant applications.\n• Mentor and guide students and colleagues and develop the next generation of academics through involvement in the supervision of HDRs (as per the norms of the discipline).\n• Align with and actively demonstrate the UNSW Values in Action: Our Behaviours and the UNSW Code of Conduct.\n• Cooperate with all health and safety policies and procedures of the university and take all reasonable care to ensure that your actions or omissions do not impact the health and safety of yourself or others.\n\nLevel C – Senior Lecturer\n\nSpecific accountabilities for the role of Level C Senior Lecturer include:\n• Apply a well-defined teaching philosophy and a critically reflective teaching practice that inspires student learning.\n• Conduct classes, assess student learning achievements, and support students in both postgraduate and undergraduate courses in line with UNSW policy.\n• Design and develop learning activities and resources and provide assessment and feedback at both course and program levels using a range of suitable approaches and learning environments.\n• Support learning progression with students as individuals (through such things as one-to-one consultation) and as a cohort (through general course-related advice) to achieve positive learning and employability outcomes for students.\n• Manage course administration as Course Authority, including academic quality assurance.\n• Maintain and develop links within the discipline industry and profession (e.g. contribute to professional development activities).\n• Work collaboratively to identify and apply for internal education funding opportunities.\n• Make a positive contribution by leading School meetings and seminars and being a member of School/Faculty committees as required.\n• Make independent contributions to research that have a significant impact in their field of expertise and create a nationally recognised research track record.\n• Undertake independent research in a discipline or related area (as per the norms of the discipline), making an independent contribution through professional practice and expertise.\n• Develop research groups in the area of specialist expertise and research methods that are appropriate to the discipline.\n• Attract peer recognition and establish research network/s (based on the norms of the discipline) at the national level.\n• Obtain research income from nationally competitive research grants (and/or research fellowships) and research end-users as a member or leader, at or above the level that is relevant to the discipline in leading universities.\n• Mentor and guide students, groups, and colleagues; supervise HDRs to timely completion as primary supervisor; and contribute to HDR review panels.\n• Align with and actively demonstrate the UNSW Values in Action: Our Behaviours and the UNSW Code of Conduct.\n• Cooperate with all university health and safety policies and procedures and take all reasonable care to ensure that your actions or omissions do not impact your health and safety or that of others.\n\nSkills And Experience\n\nLevel B\n• A PhD in a related discipline, and/or relevant work experience.\n• Proven commitment to proactively keeping up to date with discipline knowledge and developments.\n• Demonstrated experience in teaching and learning design, development and delivery at undergraduate and/or postgraduate level.\n• Experience using and/or designing with educational technologies and online delivery methods.\n• Evidence of teaching effectiveness and passion for educational excellence (e.g. relevant discipline-based curriculum design and development at a variety of levels and scales).\n• Demonstrated knowledge of industry or experience in work-integrated learning (desirable).\n• Evidence of ability to support and inspire students from diverse backgrounds and support student equity, diversity and inclusion initiatives.\n• Demonstrated track record in research with outcomes of high quality and high impact with clear evidence of the desire and ability to continually achieve research excellence as well as the capacity for research leadership.\n• A track record of significant involvement with the profession and/or industry.\n• High-level communication skills and ability to network effectively and interact with a diverse range of students and staff.\n• Demonstrated ability to work in a team, collaborate across disciplines and build effective relationships.\n• Evidence of highly developed interpersonal and organisational skills.\n• An understanding of and commitment to UNSW’s aims, objectives and values in action, together with relevant policies and guidelines.\n• Knowledge of health and safety responsibilities and commitment to attending relevant health and safety training.\n\nLevel C\n• A PhD in a related discipline, and/or relevant work experience.\n• Proven commitment to proactively keeping up to date with discipline knowledge and developments.\n• Demonstrated experience in teaching and learning design using a range of pedagogical approaches, development and delivery of courses and programs, at undergraduate and/or postgraduate levels.\n• Experience in implementing educational technologies and online delivery methods.\n• Evidence of teaching effectiveness and passion for educational excellence and fostering this in others.\n• Demonstrated success in initiating curriculum development and improvement.\n• Demonstrated experience with industry or work-integrated learning.\n• Evidence of ability to support and inspire students from diverse backgrounds and support student equity, diversity and inclusion initiatives.\n• Demonstrated track record in research with outcomes of high quality and high impact with clear evidence of the desire and ability to continually achieve research excellence as well as the capacity for research leadership.\n• Experience in successfully recruiting and supervising high-calibre students.\n• Demonstrated ability to work in a team, collaborate across disciplines and build effective relationships.\n• Evidence of highly developed interpersonal and organisational skills.\n• Demonstrated ability to interact with the profession and industry and attract funding for learning and teaching initiatives.\n• An understanding of and commitment to UNSW’s aims, objectives and values in action, together with relevant policies and guidelines.\n• Knowledge of health and safety responsibilities and commitment to attending relevant health and safety training.\n\nTo Apply: Please click the “Apply Now” button and submit your CV, Cover Letter and Responses to the Skills and Experience. You should systematically address the Skills and Experience listed above in your application.\n\nIf you're excited about this role and think you have what it takes, but your experience doesn't align 100%, we still want to hear from you and would encourage you to apply.\n\nIf You Have Had Any Interruption In Your Career, You Are Encouraged To Include a ROPE Statement As Part Of Your Application, For Information On ROPE, Check\n\nhttps://www.arc.gov.au/about-arc/program-policies/research-opportunity-and-performance-evidence-rope-statement\n\nPlease note applications will not be accepted if sent to the contact listed below.\n\nContact:\n\nEugene Aves – Talent Acquisition Consultant\n\nE: eugene.aves@unsw.edu.au\n\nUNSW is committed to evolving a culture that embraces equity and supports a diverse and inclusive community where everyone can participate fairly, in a safe and respectful environment. We welcome candidates from all backgrounds and encourage applications from people of diverse gender, sexual orientation, cultural and linguistic backgrounds, Aboriginal and Torres Strait Islander background, people with disability and those with caring and family responsibilities. UNSW provides workplace adjustments for people with disability, and access to flexible work options, including working from home, for eligible staff. UNSW provides 26 weeks of fully paid maternity or primary carers leave upon commencement of employment (subject to eligibility). UNSW is committed to enhancing the experience of ECAs by providing a supportive and collegial work environment and a dedicated framework to deliver support services to assist their research, teaching, and career development. The University reserves the right not to proceed with any appointment.",
    "url": "https://uk.linkedin.com/jobs/view/lecturer-senior-lecturer-in-computer-science-and-engineering-at-unsw-4010460819?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false,
    "interviews": [
        {
            "name": "Preliminary Round",
            "type": "Technical",
            "score": 0
        },
        {
            "name": "Personal",
            "type": "HR",
            "score": 0
        },
        {
            "name": "Technical Interview",
            "type": "Managerial",
            "score": 0
        }
    ]
}