{
    "position": "Operational Automation Developer (Internal Post Graduate Role Only)",
    "name": "Everflow",
    "description": "Job Advert\n\n**PLEASE NOTE: THIS ROLE IS FOR INTERNAL EMPLOYEES ONLY**\n\n**A bit about us**\n\n\nEverflow is proud to be recognised as one of Europe's fastest\\-growing companies, securing the 51st and 3rd spots in the Financial Times' annual Fastest 1000 Growing Companies ranking over the past three years. By 2024, we've achieved a turnover of approximately £154 million, marking a growth of about 33% on Financial Year 2023\\. As a technology\\-enabled utility company, we're leading the charge towards a sustainable, multi\\-utility future for Small and Medium\\-sized Enterprises (SMEs).\n\n\n Our mission is to make utilities simple and create jobs that people love.\n\n\nWe aim to enable businesses to focus on growth, reduce wastage, and contribute to environmental sustainability.\n\n **Our approach includes:**\n\n* Prioritising investment in our team, creating fulfilling roles that people are passionate about.\n* We firmly believe in prioritising people over profits in our decision\\-making process.\n* Offering greener, more transparent utility options.\n* Delivering an automated, digital\\-first experience.\n* Simplifying the process for businesses to reduce their utility consumption.\n* Enhancing the broker market by developing the premier sales platform for multi\\-utility services.\n\n **The Role**\n\n\nWe are seeking a skilled Blue Prism Developer to join our team. The ideal candidate will have a strong background in Robotic Process Automation (RPA) and experience in developing and maintaining Blue Prism solutions. You will collaborate with cross\\-functional teams to automate business processes, improve efficiency, and enhance productivity\n\n\nAs an Operational Automation Developer, you will be hands on in optimising, simplifying and reducing inefficiencies in business processes. Your primary tool will be Robotic Process Automation (RPA) software, including automation of Excel, and other business systems.\n\n\nYou will play a pivotal role in driving operational efficiency and process improvement across all utilities provided by Everflow. There is an expectation that the role embodies a unique fusion of being both a player and a developer.\n\n\nYou will be reporting directly to the Operational Automation Team Leader. You will have the opportunity to work closely with other departments of the business to identify broad changes that impact multiple business areas.\n\n\nThe role's scope extends beyond standard automation. You will also be expected to continue your professional development and learn about enhancing process automation via other associated methods, for example linking to systems through APIs, working with document reading software and anything else that enables better and more effective automation.\n\n**Job Purpose**\n\n* Develop automations across our utilities, enhancing efficiency, saving costs, and improving customer experiences\n* Champion operational excellence through RPA and automation\n* Identify business wide issues that if resolved will have positive impact.\n* Identify potential improvements to “as is” business processes and enable these improvements via automation\n\n **Core Responsibilities**\n\n* Be a champion for Automation\n* Exemplify the Everflow values of Making Things Simpler\\-er, Doing the Right Thing, Showing We Care, Being the Best, Making the Dream Work through Team Work, and Having a Laugh\n* Recognise inefficiencies and make suggestions for making improvements.\n* Develop and maintain strong relationships with key players in all areas across the business, identifying areas for automation improvements.\n* Ensure compliance with applicable laws and regulations when changing process or recommending change.\n* Perform periodic audits of business processes\n* Make informed decisions regarding new automation releases, considering deployment speed, potential savings, and associated risks.\n* Design, develop, and implement Blue Prism solutions based on business requirements.\n* Create and maintain technical documentation for RPA processes and solutions.\n* Troubleshoot and resolve issues related to Blue Prism applications and workflows.\n* Conduct testing and validation of developed processes to ensure quality and performance.\n* Monitor and maintain existing RPA solutions for performance and scalability.\n* Stay updated on industry trends and best practices in RPA and Blue Prism technologies\n\n **Experience**\n\n* Proven experience as a Blue Prism Developer with a strong understanding of RPA concepts.\n* + Proficiency in Blue Prism development, including creating, testing, and deploying automation solutions.\n\t+ Demonstrated ability to work independently in an unstructured environment.\n\t+ Strong problem\\-solving skills and attention to detail.\n\t+ Excellent communication and interpersonal skills.\n\n **Key Skills**\n\n* Minimum of 1 year RPA experience.\n* Professional attitude to work.\n* Excellent communication skills.\n* Excellent interpersonal skills.\n* Proven experience in a service environment.\n* High degree of numeracy.\n* Well\\-developed Excel skills.\n* A willingness to roll\\-up sleeves, be flexible and focused on results.\n* A hunger and excitement to work in a fast\\-paced business.\n* Strong team player, able to motivate teams facing stretching deadlines.\n* Knowledge of Lean or Six Sigma methodologies\n\n **Desirables**\n\n* Blue Prism Developer qualification or equivalent",
    "url": "https://uk.indeed.com/viewjob?jk=04c90bd4e3c7df1f",
    "is_remote": false,
    "interviews": [
        {
            "name": "Preliminary Round",
            "type": "Technical",
            "score": 0
        },
        {
            "name": "Personal",
            "type": "HR",
            "score": 0
        },
        {
            "name": "Technical Interview",
            "type": "Managerial",
            "score": 0
        }
    ]
}